<template>
   <v-container>
      <v-row>
         <v-col>
            <app-header :header-title="'Про сайт'" />
            <v-main>
               <v-list-item-title class="text-subtitle-1 ml-2"></v-list-item-title>
               <p>Ласкаво просимо на наш сайт ГОРОДИНА. Ми пропонуємо великий вибір товарів та зручний спосіб їх замовлення та оплати.</p>
               <p>У нас є:</p>
               <div>
                  <section>
                     <h3>Каталог</h3>
                     <p>Наш каталог - це величезна колекція високоякісних продуктів для вашого саду та городу. Від рослин і садового інструменту до декору та засобів для догляду за рослинами, у нас є все необхідне для створення ідеального саду.</p>
                  </section>

                  <section>
                     <h3>Кошик</h3>
                     <p>Використовуйте наш кошик для легкості і зручності при покупках. Додавайте продукти в кошик і зручно керуйте своїми покупками перед оформленням замовлення.</p>
                  </section>

                  <section>
                     <h3>Мапа</h3>
                     <p>Наша інтерактивна мапа допомагає вам знаходити потрібні товари в нашому магазині. Просто клікніть на інтересуючий вас розділ на мапі, щоб відкрити деталі та переглянути асортимент.</p>
                  </section>

                  <section>
                     <h3>Оформлення замовлення</h3>
                     <p>Легко та швидко оформлюйте замовлення через наш інтуїтивно зрозумілий процес оформлення. Додайте свою адресу доставки, виберіть зручний спосіб оплати та отримайте свої покупки легко.</p>
                  </section>

                  <section>
                     <h3>Історія покупок</h3>
                     <p>Зберігайте свою історію покупок, щоб легко відслідковувати та повторювати ваші улюблені покупки. Ви завжди можете переглядати свої минулі замовлення та відстежувати їх статус.</p>
                  </section>

                  <section>
                     <h3>Меню налаштувань</h3>
                     <p>Персоналізуйте свій досвід використання сайту за допомогою меню налаштувань. Встановлюйте власні налаштування для отримання повідомлень, вибору мови та інших параметрів, щоб зробити сайт максимально зручним для вас.</p>
                  </section>
               </div>
            </v-main>
         </v-col>
      </v-row>
   </v-container>
</template>

<script lang='ts' setup>
import AppHeader from '@/components/AppHeader.vue';

export default {
   name: 'AboutPage',
   components: {
      AppHeader,
   },
};
</script>

<style scoped>
p {
   margin-bottom: 10px;
}

ul {
   padding-left: 20px;
}

li {
   margin-bottom: 5px;
}
</style>